contiki-os/contiki/cc26xxware/inc/hw_gpio.h
// Field: [8]    DIO8
//
// Clears bit 8
#define GPIO_DOUTCLR31_0_DIO8                                       0x00000100
#define GPIO_DOUTCLR31_0_DIO8_BITN                                  8
#define GPIO_DOUTCLR31_0_DIO8_M                                     0x00000100
#define GPIO_DOUTCLR31_0_DIO8_S                                     8

// Field: [7]    DIO7
//
// Clears bit 7
#define GPIO_DOUTCLR31_0_DIO7                                       0x00000080
#define GPIO_DOUTCLR31_0_DIO7_BITN                                  7
#define GPIO_DOUTCLR31_0_DIO7_M                                     0x00000080
#define GPIO_DOUTCLR31_0_DIO7_S                                     7

// Field: [6]    DIO6
//
// Clears bit 6
#define GPIO_DOUTCLR31_0_DIO6                                       0x00000040
#define GPIO_DOUTCLR31_0_DIO6_BITN                                  6
#define GPIO_DOUTCLR31_0_DIO6_M                                     0x00000040
#define GPIO_DOUTCLR31_0_DIO6_S                                     6

// Field: [5]    DIO5
//
// Clears bit 5
#define GPIO_DOUTCLR31_0_DIO5                                       0x00000020
#define GPIO_DOUTCLR31_0_DIO5_BITN                                  5
#define GPIO_DOUTCLR31_0_DIO5_M                                     0x00000020
#define GPIO_DOUTCLR31_0_DIO5_S                                     5

// Field: [4]    DIO4
//
// Clears bit 4
#define GPIO_DOUTCLR31_0_DIO4                                       0x00000010
#define GPIO_DOUTCLR31_0_DIO4_BITN                                  4
#define GPIO_DOUTCLR31_0_DIO4_M                                     0x00000010
#define GPIO_DOUTCLR31_0_DIO4_S                                     4

// Field: [3]    DIO3
//
// Clears bit 3
#define GPIO_DOUTCLR31_0_DIO3                                       0x00000008
#define GPIO_DOUTCLR31_0_DIO3_BITN                                  3
#define GPIO_DOUTCLR31_0_DIO3_M                                     0x00000008
#define GPIO_DOUTCLR31_0_DIO3_S                                     3

// Field: [2]    DIO2
//
// Clears bit 2
#define GPIO_DOUTCLR31_0_DIO2                                       0x00000004
#define GPIO_DOUTCLR31_0_DIO2_BITN                                  2
#define GPIO_DOUTCLR31_0_DIO2_M                                     0x00000004
#define GPIO_DOUTCLR31_0_DIO2_S                                     2

// Field: [1]    DIO1
//
// Clears bit 1
#define GPIO_DOUTCLR31_0_DIO1                                       0x00000002
#define GPIO_DOUTCLR31_0_DIO1_BITN                                  1
#define GPIO_DOUTCLR31_0_DIO1_M                                     0x00000002
#define GPIO_DOUTCLR31_0_DIO1_S                                     1

// Field: [0]    DIO0
//
// Clears bit 0
#define GPIO_DOUTCLR31_0_DIO0                                       0x00000001
#define GPIO_DOUTCLR31_0_DIO0_BITN                                  0
#define GPIO_DOUTCLR31_0_DIO0_M                                     0x00000001
#define GPIO_DOUTCLR31_0_DIO0_S                                     0

//*****************************************************************************
//
// Register: GPIO_O_DOUTTGL31_0
//
//*****************************************************************************
// Field: [31]    DIO31
//
// Toggles bit 31
#define GPIO_DOUTTGL31_0_DIO31                                      0x80000000
#define GPIO_DOUTTGL31_0_DIO31_BITN                                 31
#define GPIO_DOUTTGL31_0_DIO31_M                                    0x80000000
#define GPIO_DOUTTGL31_0_DIO31_S                                    31

// Field: [30]    DIO30
//
// Toggles bit 30
#define GPIO_DOUTTGL31_0_DIO30                                      0x40000000
#define GPIO_DOUTTGL31_0_DIO30_BITN                                 30
#define GPIO_DOUTTGL31_0_DIO30_M                                    0x40000000
#define GPIO_DOUTTGL31_0_DIO30_S                                    30

// Field: [29]    DIO29
//
// Toggles bit 29
#define GPIO_DOUTTGL31_0_DIO29                                      0x20000000
#define GPIO_DOUTTGL31_0_DIO29_BITN                                 29
#define GPIO_DOUTTGL31_0_DIO29_M                                    0x20000000
#define GPIO_DOUTTGL31_0_DIO29_S                                    29

// Field: [28]    DIO28
//
// Toggles bit 28
#define GPIO_DOUTTGL31_0_DIO28                                      0x10000000
#define GPIO_DOUTTGL31_0_DIO28_BITN                                 28
#define GPIO_DOUTTGL31_0_DIO28_M                                    0x10000000
#define GPIO_DOUTTGL31_0_DIO28_S                                    28

// Field: [27]    DIO27
//
// Toggles bit 27
#define GPIO_DOUTTGL31_0_DIO27                                      0x08000000
#define GPIO_DOUTTGL31_0_DIO27_BITN                                 27
#define GPIO_DOUTTGL31_0_DIO27_M                                    0x08000000
#define GPIO_DOUTTGL31_0_DIO27_S                                    27

// Field: [26]    DIO26
//
// Toggles bit 26
#define GPIO_DOUTTGL31_0_DIO26                                      0x04000000
#define GPIO_DOUTTGL31_0_DIO26_BITN                                 26
#define GPIO_DOUTTGL31_0_DIO26_M                                    0x04000000
#define GPIO_DOUTTGL31_0_DIO26_S                                    26

// Field: [25]    DIO25
//
// Toggles bit 25
#define GPIO_DOUTTGL31_0_DIO25                                      0x02000000
#define GPIO_DOUTTGL31_0_DIO25_BITN                                 25
#define GPIO_DOUTTGL31_0_DIO25_M                                    0x02000000
#define GPIO_DOUTTGL31_0_DIO25_S                                    25

// Field: [24]    DIO24
//
// Toggles bit 24
#define GPIO_DOUTTGL31_0_DIO24                                      0x01000000
#define GPIO_DOUTTGL31_0_DIO24_BITN                                 24
#define GPIO_DOUTTGL31_0_DIO24_M                                    0x01000000
#define GPIO_DOUTTGL31_0_DIO24_S                                    24

// Field: [23]    DIO23
//
// Toggles bit 23
#define GPIO_DOUTTGL31_0_DIO23                                      0x00800000
#define GPIO_DOUTTGL31_0_DIO23_BITN                                 23
#define GPIO_DOUTTGL31_0_DIO23_M                                    0x00800000
#define GPIO_DOUTTGL31_0_DIO23_S                                    23

// Field: [22]    DIO22
//
// Toggles bit 22
#define GPIO_DOUTTGL31_0_DIO22                                      0x00400000
#define GPIO_DOUTTGL31_0_DIO22_BITN                                 22
#define GPIO_DOUTTGL31_0_DIO22_M                                    0x00400000
#define GPIO_DOUTTGL31_0_DIO22_S                                    22

