contiki-os/contiki/cc26xxware/inc/hw_gpio.h
// Field: [12]    DIO12
//
// Data input from DIO 12
#define GPIO_DIN31_0_DIO12                                          0x00001000
#define GPIO_DIN31_0_DIO12_BITN                                     12
#define GPIO_DIN31_0_DIO12_M                                        0x00001000
#define GPIO_DIN31_0_DIO12_S                                        12

// Field: [11]    DIO11
//
// Data input from DIO 11
#define GPIO_DIN31_0_DIO11                                          0x00000800
#define GPIO_DIN31_0_DIO11_BITN                                     11
#define GPIO_DIN31_0_DIO11_M                                        0x00000800
#define GPIO_DIN31_0_DIO11_S                                        11

// Field: [10]    DIO10
//
// Data input from DIO 10
#define GPIO_DIN31_0_DIO10                                          0x00000400
#define GPIO_DIN31_0_DIO10_BITN                                     10
#define GPIO_DIN31_0_DIO10_M                                        0x00000400
#define GPIO_DIN31_0_DIO10_S                                        10

// Field: [9]    DIO9
//
// Data input from DIO 9
#define GPIO_DIN31_0_DIO9                                           0x00000200
#define GPIO_DIN31_0_DIO9_BITN                                      9
#define GPIO_DIN31_0_DIO9_M                                         0x00000200
#define GPIO_DIN31_0_DIO9_S                                         9

// Field: [8]    DIO8
//
// Data input from DIO 8
#define GPIO_DIN31_0_DIO8                                           0x00000100
#define GPIO_DIN31_0_DIO8_BITN                                      8
#define GPIO_DIN31_0_DIO8_M                                         0x00000100
#define GPIO_DIN31_0_DIO8_S                                         8

// Field: [7]    DIO7
//
// Data input from DIO 7
#define GPIO_DIN31_0_DIO7                                           0x00000080
#define GPIO_DIN31_0_DIO7_BITN                                      7
#define GPIO_DIN31_0_DIO7_M                                         0x00000080
#define GPIO_DIN31_0_DIO7_S                                         7

// Field: [6]    DIO6
//
// Data input from DIO 6
#define GPIO_DIN31_0_DIO6                                           0x00000040
#define GPIO_DIN31_0_DIO6_BITN                                      6
#define GPIO_DIN31_0_DIO6_M                                         0x00000040
#define GPIO_DIN31_0_DIO6_S                                         6

// Field: [5]    DIO5
//
// Data input from DIO 5
#define GPIO_DIN31_0_DIO5                                           0x00000020
#define GPIO_DIN31_0_DIO5_BITN                                      5
#define GPIO_DIN31_0_DIO5_M                                         0x00000020
#define GPIO_DIN31_0_DIO5_S                                         5

// Field: [4]    DIO4
//
// Data input from DIO 4
#define GPIO_DIN31_0_DIO4                                           0x00000010
#define GPIO_DIN31_0_DIO4_BITN                                      4
#define GPIO_DIN31_0_DIO4_M                                         0x00000010
#define GPIO_DIN31_0_DIO4_S                                         4

// Field: [3]    DIO3
//
// Data input from DIO 3
#define GPIO_DIN31_0_DIO3                                           0x00000008
#define GPIO_DIN31_0_DIO3_BITN                                      3
#define GPIO_DIN31_0_DIO3_M                                         0x00000008
#define GPIO_DIN31_0_DIO3_S                                         3

// Field: [2]    DIO2
//
// Data input from DIO 2
#define GPIO_DIN31_0_DIO2                                           0x00000004
#define GPIO_DIN31_0_DIO2_BITN                                      2
#define GPIO_DIN31_0_DIO2_M                                         0x00000004
#define GPIO_DIN31_0_DIO2_S                                         2

// Field: [1]    DIO1
//
// Data input from DIO 1
#define GPIO_DIN31_0_DIO1                                           0x00000002
#define GPIO_DIN31_0_DIO1_BITN                                      1
#define GPIO_DIN31_0_DIO1_M                                         0x00000002
#define GPIO_DIN31_0_DIO1_S                                         1

// Field: [0]    DIO0
//
// Data input from DIO 0
#define GPIO_DIN31_0_DIO0                                           0x00000001
#define GPIO_DIN31_0_DIO0_BITN                                      0
#define GPIO_DIN31_0_DIO0_M                                         0x00000001
#define GPIO_DIN31_0_DIO0_S                                         0

//*****************************************************************************
//
// Register: GPIO_O_DOE31_0
//
//*****************************************************************************
// Field: [31]    DIO31
//
// Data output enable for DIO 31
#define GPIO_DOE31_0_DIO31                                          0x80000000
#define GPIO_DOE31_0_DIO31_BITN                                     31
#define GPIO_DOE31_0_DIO31_M                                        0x80000000
#define GPIO_DOE31_0_DIO31_S                                        31

// Field: [30]    DIO30
//
// Data output enable for DIO 30
#define GPIO_DOE31_0_DIO30                                          0x40000000
#define GPIO_DOE31_0_DIO30_BITN                                     30
#define GPIO_DOE31_0_DIO30_M                                        0x40000000
#define GPIO_DOE31_0_DIO30_S                                        30

// Field: [29]    DIO29
//
// Data output enable for DIO 29
#define GPIO_DOE31_0_DIO29                                          0x20000000
#define GPIO_DOE31_0_DIO29_BITN                                     29
#define GPIO_DOE31_0_DIO29_M                                        0x20000000
#define GPIO_DOE31_0_DIO29_S                                        29

// Field: [28]    DIO28
//
// Data output enable for DIO 28
#define GPIO_DOE31_0_DIO28                                          0x10000000
#define GPIO_DOE31_0_DIO28_BITN                                     28
#define GPIO_DOE31_0_DIO28_M                                        0x10000000
#define GPIO_DOE31_0_DIO28_S                                        28

// Field: [27]    DIO27
//
// Data output enable for DIO 27
#define GPIO_DOE31_0_DIO27                                          0x08000000
#define GPIO_DOE31_0_DIO27_BITN                                     27
#define GPIO_DOE31_0_DIO27_M                                        0x08000000
#define GPIO_DOE31_0_DIO27_S                                        27

